"{\n  \"name\": \"Blocksworld30Instance16\",\n  \"author\": \"Human\",\n  \"agents\": {\n    \"number\": 3,\n    \"names\": [\n      \"robot1\",\n      \"robot2\",\n      \"orchestrator\"\n    ],\n    \"robot1\": {\n      \"private_information\": [\n        \"I am robot1 and I execute the first half of the action sequence: actions 1 through 15.\"\n      ],\n      \"goal\": \"Execute and report the effects of actions 1-15 from the provided action sequence and provide a local configuration summary.\"\n    },\n    \"robot2\": {\n      \"private_information\": [\n        \"I am robot2 and I execute the second half of the action sequence: actions 16 through 30.\"\n      ],\n      \"goal\": \"Execute and report the effects of actions 16-30 from the provided action sequence and provide a local configuration summary.\"\n    },\n    \"orchestrator\": {\n      \"private_information\": [],\n      \"goal\": \"Integrate the agents' reports, produce a complete PDDL domain and a PDDL problem targeting the FastDownwards solver that encodes the initial state and the derived final arrangement, and present the final block arrangement.\"\n    }\n  },\n  \"environment\": {\n    \"init\": {\n      \"num_blocks\": 9\n    },\n    \"public_information\": [\n      \"Blocks present: A B C D E F G H I.\",\n      \"Standard BlocksWorld rules: only the top block of a stack can be moved and only one block can be carried at a time.\",\n      \"Initial stacks expressed bottom-to-top: Stack1: D A G, Stack2: C H B, Stack3: E I F. That is, A is on D; G is on A; B is on H; H is on C; F is on I; I is on E; C, D, E are on the table.\",\n      \"Action sequence in order: 1 unstack(G,A), 2 stack(G,F), 3 unstack(B,H), 4 stack(B,G), 5 unstack(H,C), 6 stack(H,A), 7 unstack(H,A), 8 putdown(H), 9 pickup(H), 10 stack(H,B), 11 unstack(A,D), 12 stack(A,H), 13 pickup(D), 14 stack(D,C), 15 unstack(A,H), 16 putdown(A), 17 unstack(H,B), 18 putdown(H), 19 unstack(B,G), 20 stack(B,H), 21 unstack(G,F), 22 stack(G,B), 23 unstack(D,C), 24 stack(D,C), 25 unstack(F,I), 26 stack(F,G), 27 pickup(A), 28 putdown(A), 29 unstack(D,C), 30 stack(D,C).\",\n      \"Final arrangement derived from applying the above actions sequentially: A is on the table; B is on H; C is on the table; D is on C; E is on the table; F is on G; G is on B; H is on the table; I is on E.\"\n    ]\n  },\n  \"workflow\": {\n    \"robot1\": {\n      \"report\": {\n        \"input\": [],\n        \"output\": \"report_robot1\",\n        \"system_prompt\": \"You are robot1 participating in a multi-agent BlocksWorld run. You have private knowledge of being responsible for the first 15 actions. Provide a concise factual report of each action you executed and the immediate local effects on the stacks that you observe. Do not produce PDDL output. Focus on which blocks you moved, their sources, and their destinations and the resulting local stack fragments.\",\n        \"prompt\": \"Your name is robot1. Use the public information environment->public_information and your private information agents->robot1->private_information and your goal agents->robot1->goal. Produce a concise machine-readable report enumerating the actions you performed (1-15) and the local stack configuration after those actions.\"\n      }\n    },\n    \"robot2\": {\n      \"report\": {\n        \"input\": [],\n        \"output\": \"report_robot2\",\n        \"system_prompt\": \"You are robot2 participating in a multi-agent BlocksWorld run. You have private knowledge of being responsible for actions 16 through 30. Provide a concise factual report of each action you executed and the immediate local effects on the stacks that you observe. Do not produce PDDL output. Focus on which blocks you moved, their sources, and their destinations and the resulting local stack fragments.\",\n        \"prompt\": \"Your name is robot2. Use the public information environment->public_information and your private information agents->robot2->private_information and your goal agents->robot2->goal. Produce a concise machine-readable report enumerating the actions you performed (16-30) and the local stack configuration after those actions.\"\n      }\n    },\n    \"orchestrator\": {\n      \"pddl\": {\n        \"input\": [\n          \"report_robot1\",\n          \"report_robot2\"\n        ],\n        \"output\": \"pddl_orchestrator\",\n        \"system_prompt\": \"You are the orchestrator for a two-agent BlocksWorld instance. Integrate the agents' reports and the public information to produce a complete PDDL domain and a PDDL problem file suitable for the FastDownwards planner. The PDDL must encode the BlocksWorld actions and the instance initial state and the desired final arrangement. Enclose the PDDL domain between <domain></domain> tags and the PDDL problem between <problem></problem> tags. Keep agent-origin of actions distinct if that is required, and ensure the PDDL is compatible with FastDownwards.\n\",\n        \"prompt\": \"You receive the two agents' reports report_robot1 and report_robot2 together with environment->public_information. Integrate their reports to build a single coherent PDDL domain and a PDDL problem targeting the FastDownwards solver that encodes the initial configuration and the derived final arrangement. Enclose the domain between <domain></domain> and the problem between <problem></problem>. Also include a short final-state summary mapping each block to either the table or the block it is on.\"\n      }\n    },\n    \"constraints\": [\n      \"robot1.report->orchestrator.pddl\",\n      \"robot2.report->orchestrator.pddl\"\n    ]\n  }\n}"